app/views/tweets/_feed.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."tweet_id" = $1  [["tweet_id", 10]]
---
        <!-- LIKE/UNLIKE FUNCTIONALITY -->
        <% pre_like = tweet.likes.find { |like| like.user_id == current_user.id } %>

SELECT COUNT(*) FROM "likes" WHERE "likes"."tweet_id" = $1  [["tweet_id", 10]]
---
        <% end %>
        <small class="level-item"> <%= tweet.likes.count %> <%= (tweet.likes.count) == 1 ? 'Like' : 'Likes' %> </small>