app/views/tweets/_profile.html.erb

SELECT COUNT(*) FROM "tweets" WHERE "tweets"."user_id" = $1  [["user_id", 52]]
---
						<p class="heading">DashNotes</p>
						<p class="title is-6"><%= current_user.tweets.count %></p>