app/views/users/show.html.erb

SELECT COUNT(*) FROM "tweets" WHERE "tweets"."user_id" = $1  [["user_id", 2]]
---
                <p class="title is-6">
                  <%= @user.tweets.count %>