app/controllers/likes_controller.rb

INSERT INTO "likes" ("tweet_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tweet_id", 2], ["user_id", 52], ["created_at", "2019-07-08 14:44:12.815560"], ["updated_at", "2019-07-08 14:44:12.815560"]]
---
	def create
		if already_liked?
			flash[:alert] = "You can only like a DashNote once."
		else
		    @tweet.likes.create(user_id: current_user.id)

DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]
---
	def destroy
		if !(already_liked?)
			flash[:alert] = "Cannot unlike"
		else
			@like.destroy

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
	def find_tweet
		@tweet = Tweet.find(params[:tweet_id])

SELECT  1 AS one FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."tweet_id" = $2 LIMIT $3  [["user_id", 52], ["tweet_id", 2], ["LIMIT", 1]]
---
	def already_liked?
		Like.where(user_id: current_user.id, tweet_id: params[:tweet_id]).exists?

SELECT  "likes".* FROM "likes" WHERE "likes"."tweet_id" = $1 AND "likes"."id" = $2 LIMIT $3  [["tweet_id", 2], ["id", 1], ["LIMIT", 1]]
---
	def find_like
		@like = @tweet.likes.find(params[:id])