app/controllers/relationships_controller.rb

	def create
		user = User.find(params[:followed_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

	def destroy
		user = Relationship.find(params[:id]).followed
---
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."id" = $1 LIMIT $2  [["id", 93], ["LIMIT", 1]]