app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.all.order("created_at DESC")
---
SELECT "tweets".* FROM "tweets" ORDER BY created_at DESC

  def create
    @tweet = current_user.tweets.build(tweet_params)

    respond_to do |format|
      if @tweet.save
---
INSERT INTO "tweets" ("tweet", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tweet", "First Dash with the new interface!"], ["created_at", "2019-07-08 14:52:48.829802"], ["updated_at", "2019-07-08 14:52:48.829802"], ["user_id", 52]]

  def update
    respond_to do |format|
      if @tweet.update(tweet_params)
---
UPDATE "tweets" SET "tweet" = $1, "updated_at" = $2 WHERE "tweets"."id" = $3  [["tweet", "This looks much better than what I had before. I can edit this tweet."], ["updated_at", "2019-07-10 19:52:48.783774"], ["id", 12]]